      ******************************************************************
      * Author: Raphael Ervin S. Lopez
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Shortest.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Eyyy Lmao"
            STOP RUN.
       END PROGRAM Shortest.
